Repository: jessicaernst/portfolio_site
Catalog: demo/l10n/app_*.arb
Languages: de

# app_title
source: Demo Portfolio (Placeholder)
de: Demo-Portfolio (Platzhalter)

# nav_home
source: Home (demo)
de: Start (Demo)

# nav_imprint
source: Imprint (demo)
de: Impressum (Demo)

# nav_privacy
source: Privacy (demo)
de: Datenschutz (Demo)

# nav_language
source: Language
de: Sprache

# nav_contact
source: Contact
de: Kontakt

# hero_download_cv
source: Download CV
de: CV herunterladen

# about_title
source: About Me
de: Über mich

# about_description_1
source: Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.
de: Ich bringe fundierte Erfahrung in der Entwicklung moderner mobiler Anwendungen mit – kombiniert mit einem ausgeprägten Interesse an neuen Technologien. In agilen, dynamischen Projektumfeldern arbeite ich lösungsorientiert, kommunikationsstark und mit einem klaren Ziel: Nutzerbedürfnisse und Teamdynamik.

# about_description_2
source: Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.
de: Dabei schätze ich den Austausch auf Augenhöhe, unterstütze eine offene Feedbackkultur und übernehme gerne Verantwortung.

# about_description_3
source: Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.
de: Durch kontinuierliche Weiterbildung erweitere ich mein Wissen gezielt und denke dabei gern über etablierte Grenzen hinaus – immer mit dem Ziel, qualitativ hochwertige, nachhaltige und gemeinsam getragene Ergebnisse zu schaffen.

# skills_subtitle
source: Technical Skills
de: Technische Skills

# projects_title
source: Current Projects
de: Aktuelle Projekte

# projects_brainbench_subtitle
source: Multimodal Quiz & Learning App
de: Multimodales Quiz & Lern-App

# projects_brainbench_description
source: Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.
de: Eine mobile Lernplattform mit Quizfunktionen, Kategorien & Themenverwaltung, integrierten Fortschrittssystem und Progress Tracking.

# projects_technologies
source: Technologies
de: Technologien

# projects_see_more
source: See More →
de: Mehr →

# experience_title
source: Professional Experience
de: Berufserfahrung

# footer_imprint
source: Legal Notice
de: Impressum

# footer_privacy
source: Privacy Policy
de: Datenschutz

# footer_contact
source: Contact
de: Kontakt

source: Home
de: Start

# languageNav
source: Language
de: Sprache

# aboutTitle
source: About Me
de: Über mich

# aboutText1
source: Demo text for the first paragraph of the about me section.
de: Demo-Text für den ersten Absatz der Über-mich-Sektion.

# aboutText2
source: Demo text for the second paragraph of the about me section.
de: Demo-Text für den zweiten Absatz der Über-mich-Sektion.

# aboutText3
source: Demo text for the third paragraph of the about me section.
de: Demo-Text für den dritten Absatz der Über-mich-Sektion.

source: Technical Skills
de: Technische Skills

source: Current Projects
de: Aktuelle Projekte

# brainbenchTitle
source: Demo Quiz & Learning App
de: Demo Quiz & Lern-App

# brainbenchDescription
source: A demo learning platform with example features for demonstration purposes.
de: Eine Demo-Lernplattform mit Beispiel-Funktionen für Demonstrationszwecke.

# brainbenchTech
source: Technologies: Flutter, Demo Backend, Example Services
de: Technologien: Flutter, Demo-Backend, Beispiel-Services

# experienceTitle
source: Professional Experience
de: Berufserfahrung

# crmDeveloper
source: Demo Developer
de: Demo-Entwickler

# crmDescription
source: Demo description for development activities
de: Demo-Beschreibung für Entwicklungstätigkeiten

# melitaCompany
source: DEMO COMPANY Ltd., DEMO CITY
de: DEMO COMPANY GmbH, DEMO-STADT

source: Mobile App Developer
de: Mobile App Entwickler

# nativeAppDescription
source: Demo description for mobile app development
de: Demo-Beschreibung für mobile App-Entwicklung

# micaboCompany
source: DEMO SOLUTIONS Ltd., DEMO CITY, REMOTE
de: DEMO SOLUTIONS GmbH, DEMO-STADT, REMOTE

# mobileAppDeveloperPM
source: App Developer & Demo Management
de: App Entwickler & Demo-Management

# moreArrow
source: More →
de: Mehr →

# downloadCV
source: Download Demo CV
de: Demo CV herunterladen

source: Contact
de: Kontakt

# imprint
source: Legal Notice
de: Impressum

source: Privacy Policy
de: Datenschutz

# about
source: About Me
de: Über mich

# heroSubtitle
source: Demo Mobile App Developer | Flutter Demo
de: Demo Mobile App Entwicklerin | Flutter Demo

# heroDescription
source: Demo description for developing modern apps with Flutter and demo technologies.
de: Demo-Beschreibung für die Entwicklung moderner Apps mit Flutter und Demo-Technologien.

source: View Portfolio
de: Portfolio ansehen

source: Scroll Down
de: Nach unten scrollen

# aboutSubtitle
source: Passionate about demo solutions
de: Leidenschaft für Demo-Lösungen

# aboutDescription
source: Demo text about passion for elegant demo solutions and modern technologies.
de: Demo-Text über die Leidenschaft für elegante Demo-Lösungen und moderne Technologien.

source: Years Experience
de: Jahre Erfahrung

source: Projects Completed
de: Abgeschlossene Projekte

source: Happy Clients
de: Zufriedene Kunden

source: Technologies Used
de: Verwendete Technologien

source: Skills
de: Fähigkeiten

source: Database
de: Datenbank

source: Tools
de: Werkzeuge

# portfolioSubtitle
source: Showcasing my demo work and projects
de: Meine Demo-Arbeiten und Projekte

source: All
de: Alle

source: Mobile
de: Mobil

source: View Demo
de: Demo ansehen

source: View Code
de: Code ansehen

source: More Info
de: Mehr Info

source: Featured
de: Hervorgehoben

# contactTitle
source: Get In Touch
de: Kontakt aufnehmen

# contactSubtitle
source: Demo contact area
de: Demo-Kontaktbereich

# contactDescription
source: Demo description for the contact area.
de: Demo-Beschreibung für den Kontaktbereich.

source: Subject
de: Betreff

source: Message
de: Nachricht

source: Send Message
de: Nachricht senden

source: Sending...
de: Wird gesendet...

# messageSent
source: Demo message sent successfully!
de: Demo-Nachricht erfolgreich gesendet!

# messageFailed
source: Demo message could not be sent.
de: Demo-Nachricht konnte nicht gesendet werden.

# fieldRequired
source: This field is required
de: Dieses Feld ist erforderlich

# invalidEmail
source: Please enter a valid email address
de: Bitte geben Sie eine gültige E-Mail-Adresse ein

# messageTooShort
source: Message must be at least 10 characters
de: Die Nachricht muss mindestens 10 Zeichen lang sein

# footerText
source: © 2025 Demo Portfolio. All rights reserved.
de: © 2025 Demo Portfolio. Alle Rechte vorbehalten.

source: Follow Me
de: Folgen Sie mir

# servicesTitle
source: Services
de: Dienstleistungen

source: Web Development
de: Webentwicklung

# webDevelopmentDesc
source: Demo description for web development services.
de: Demo-Beschreibung für Webentwicklungsdienstleistungen.

source: Mobile Development
de: Mobile Entwicklung

# mobileDevelopmentDesc
source: Demo description for mobile development services.
de: Demo-Beschreibung für mobile Entwicklungsdienstleistungen.

# uiuxDesignDesc
source: Demo description for UI/UX design services.
de: Demo-Beschreibung für UI/UX Design-Dienstleistungen.

# consulting
source: Technical Consulting
de: Technische Beratung

# consultingDesc
source: Demo description for technical consulting services.
de: Demo-Beschreibung für technische Beratungsdienstleistungen.

# testimonialsTitle
source: What Demo Clients Say
de: Was Demo-Kunden sagen

# testimonialsSubtitle
source: Demo feedback from demo clients
de: Demo-Feedback von Demo-Kunden

source: Loading...
de: Wird geladen...

# error
source: Demo error occurred
de: Demo-Fehler aufgetreten

source: Retry
de: Erneut versuchen

source: Learn More
de: Mehr erfahren

source: View All
de: Alle anzeigen

source: Close
de: Schließen

source: Back
de: Zurück

source: Next
de: Weiter

source: Previous
de: Vorherige

# heroName
source: I am Demo
de: Ich bin Demo

# heroProfessionPart3
source: DEVELOPER
de: ENTWICKLER

# moreButton
source: Demo More…
de: Demo Mehr…
